omenLee870/ZXH-SH-AISRC/Drivers/PY32F072E_HAL_Driver/Src/py32f072e_hal_can.c
/**
  ******************************************************************************
  * @file    py32f072e_hal_can.c
  * @author  MCU Application Team
  * @brief   CAN HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the CAN with Flexible Data-rate (CAN).
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Errors functions
  * @attention
  ******************************************************************************
  *
  * <h2><center>&copy; Copyright (c) Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32f0xx_hal.h"

/** @addtogroup PY32F072E_HAL_Driver
  * @{
  */
  
/** @defgroup CAN CAN
  * @brief CAN driver modules
  * @{
  */

#ifdef  HAL_CAN_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines ------------------------------------------------------------*/
/** @defgroup CAN_Private_Constants CAN Private Constants
  * @{
  */
#define CAN_TIMEOUT_VALUE 10U
#define CAN_LLC_EXTENDED_ID_MSK              (0x1FFFFFFFU)
#define CAN_LLC_STANDARD_ID_MSK              (0x7FF<<18)
#define CAN_LLC_FORMAT_MSK                   (0x1F1707FF)
/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup CAN_Private_Variables CAN Private Variables
  * @{
  */
static const uint8_t DLCtoBytes[] = {0, 1, 2, 3, 4, 5, 6, 7, 8};
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup CAN_Private_Functions CAN Private Functions
  * @{
  */
static void CAN_CopyMessageToFifo(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *pTxHeader, uint8_t *pTxData);
/**
  * @}
  */

/** @defgroup CAN_Exported_Functions CAN Exported Functions
  * @{
  */

/** @defgroup CAN_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
  * @{
  */

/**
  * @brief  CAN init
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_Init(CAN_HandleTypeDef *hcan)
{
  uint32_t tickstart;

  /* Check CAN handle */
  if (hcan == NULL)
  {
    return HAL_ERROR;
  }

  /* Check function parameters */
  assert_param(IS_CAN_ALL_INSTANCE(hcan->Instance));
  assert_param(IS_CAN_FRAME_FORMAT(hcan->Init.FrameFormat));
  assert_param(IS_CAN_MODE(hcan->Init.Mode));
  assert_param(IS_CAN_CKDIV(hcan->Init.Prescaler));
  assert_param(IS_CAN_NOMINAL_SJW(hcan->Init.NominalSyncJumpWidth));
  assert_param(IS_CAN_NOMINAL_TSEG1(hcan->Init.NominalTimeSeg1));
  assert_param(IS_CAN_NOMINAL_TSEG2(hcan->Init.NominalTimeSeg2));

  if (hcan->State == HAL_CAN_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hcan->Lock = HAL_UNLOCKED;

    /* Init the low level hardware: CLOCK, NVIC */
    HAL_CAN_MspInit(hcan);
  }

  /* forces to reset state */
  SET_BIT(hcan->Instance->MCR, CAN_MCR_RESET);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until the RESET bit into MCR register is set */
  while ((hcan->Instance->MCR & CAN_MCR_RESET) == 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
    {
      /* Update error code */
      hcan->ErrorCode |= HAL_CAN_ERROR_TIMEOUT;

      /* Change CAN state */
      hcan->State = HAL_CAN_STATE_ERROR;

      return HAL_ERROR;
    }
  }

  /* Specifies the number of time quanta in Bit */  
  hcan->Instance->ACBTR = (((hcan->Init.NominalSyncJumpWidth - 1U) << CAN_ACBTR_AC_SJW_Pos) + \
                             ((hcan->Init.NominalTimeSeg1 - 2U) << CAN_ACBTR_AC_SEG_1_Pos) + \
                             ((hcan->Init.NominalTimeSeg2 - 1U) << CAN_ACBTR_AC_SEG_2_Pos));
  
  MODIFY_REG(hcan->Instance->RLSSP, CAN_RLSSP_PRESC, ((hcan->Init.Prescaler - 1U) << CAN_RLSSP_PRESC_Pos));

  /* Initialize the error code */
  hcan->ErrorCode = HAL_CAN_ERROR_NONE;

  /* Initialize the CAN state */
  hcan->State = HAL_CAN_STATE_READY;

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  CAN MSP Init.
  * @param  hcan  Pointer to a CAN_HandleTypeDef structure that contains
  *                the configuration information for the specified CAN module.
  * @retval None
  */
__weak void HAL_CAN_MspInit(CAN_HandleTypeDef *hcan)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcan);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_CAN_MspInit could be implemented in the user file
   */
}

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
/**
  * @brief  Register a CAN CallBack.
  *         To be used instead of the weak predefined callback
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for CAN module
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_CAN_RX_COMPLETE_CB_ID             CAN Rx complete callback ID
  *           @arg @ref HAL_CAN_RX_FIFO_ALMOST_FULL_CB_ID     CAN Rx fifo almost full callback ID 
  *           @arg @ref HAL_CAN_RX_FIFO_FULL_CB_ID            CAN Rx fifo full callback ID 
  *           @arg @ref HAL_CAN_PTB_TX_COMPLETE_CB_ID         CAN PTB Tx complete callback ID 
  *           @arg @ref HAL_CAN_STB_TX_COMPLETE_CB_ID         CAN STB Tx complete callback ID
  *           @arg @ref HAL_CAN_TX_ABORT_CB_ID                CAN Tx abort callback ID         
  *           @arg @ref HAL_CAN_RX_FIFO_OVERFLOW_CB_ID        CAN Rx fifo overflow callback ID 
  *           @arg @ref HAL_CAN_ARBITRATION_LOST_CB_ID        CAN Arbitration lost callback ID 
  *           @arg @ref HAL_CAN_PASSIVE_ERROR_CB_ID           CAN Passive error callback ID
  *           @arg @ref HAL_CAN_BUS_ERROR_CB_ID               CAN Bus error callback ID 
  *           @arg @ref HAL_CAN_ERROR_CHANGE_CB_ID            CAN Error change callback ID 
  *           @arg @ref HAL_CAN_TT_RX_TIME_TRIG_CB_ID         CAN TT Rx time trig callback ID
  *           @arg @ref HAL_CAN_TT_TX_SINGLE_TRIG_CB_ID       CAN TT Tx single trig callback ID
  *           @arg @ref HAL_CAN_TT_TX_START_TRIG_CB_ID        CAN TT Tx start trig callback ID 
  *           @arg @ref HAL_CAN_TT_TX_STOP_TRIG_CB_ID         CAN TT Tx stop trig callback ID
  *           @arg @ref HAL_CAN_TT_TIMESTAMP_WRAPAROUND_CB_ID CAN TT timestamp wraparound callback ID
  *           @arg @ref HAL_CAN_TT_TRIG_ERROR_CB_ID           CAN TT trig error callback ID
  *           @arg @ref HAL_CAN_MSPINIT_CB_ID                 MspInit callback ID
  *           @arg @ref HAL_CAN_MSPDEINIT_CB_ID               MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_RegisterCallback(CAN_HandleTypeDef *hcan, HAL_CAN_CallbackIDTypeDef CallbackID, void (* pCallback)(CAN_HandleTypeDef *_hCAN))
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  if (hcan->State == HAL_CAN_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_CAN_RX_COMPLETE_CB_ID :
        hfdcan->RxCpltCallback = pCallback;
        break;

      case HAL_CAN_RX_FIFO_ALMOST_FULL_CB_ID :
        hfdcan->RxFifoAlmostFullCallback = pCallback;
        break;

      case HAL_CAN_RX_FIFO_FULL_CB_ID :
        hfdcan->RxFifoFullCallback = pCallback;
        break;

