omenLee870/ZXH-SH-AISRC/Drivers/PY32F072E_HAL_Driver/Src/py32f072e_hal_can.c
  /* Fill the protocol status structure */
  ProtocolStatus->LastArbLostPos = ((StatusReg & CAN_WECR_ALC) >> CAN_WECR_ALC_Pos);
  ProtocolStatus->LastErrorCode = ((StatusReg & CAN_WECR_KOER) >> CAN_WECR_KOER_Pos);
  ProtocolStatus->RxErrorCnt = ((StatusReg & CAN_WECR_RECNT) >> CAN_WECR_RECNT_Pos);
  ProtocolStatus->TxErrorCnt = ((StatusReg & CAN_WECR_TECNT) >> CAN_WECR_TECNT_Pos);
  
  StatusReg = READ_REG(hcan->Instance->IFR);
  
  if ((StatusReg & CAN_IFR_EPASS) != 0)
  {
    ProtocolStatus->ErrorPassive = 1;
  }
  else
  {
    ProtocolStatus->ErrorPassive = 0;
  }
  
  if ((StatusReg & CAN_IFR_EWARN) != 0)
  {
    ProtocolStatus->Warning = 1;
  }
  else
  {
    ProtocolStatus->Warning = 0;
  }
  
  ProtocolStatus->BusOff = READ_BIT(hcan->Instance->MCR, CAN_MCR_BUSOFF);
  
  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Get transmit status.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  TxStatus pointer to an CAN_TxStatusTypeDef structure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_GetTransmitStatus(CAN_HandleTypeDef *hcan, CAN_TxStatusTypeDef *TxStatus)
{
  uint32_t StatusReg;

  /* Read the protocol status register */
  StatusReg = READ_REG(hcan->Instance->TSR);

  /* Fill the protocol status structure */
  TxStatus->LastTxHandle = ((StatusReg & CAN_TSR_HANDLE_H) >> CAN_TSR_HANDLE_H_Pos);
  TxStatus->LastTxStatus = ((StatusReg & CAN_TSR_TSTAT_H) >> CAN_TSR_TSTAT_H_Pos);
  TxStatus->TxHandle = ((StatusReg & CAN_TSR_HANDLE_L) >> CAN_TSR_HANDLE_L_Pos);
  TxStatus->TxStatus = ((StatusReg & CAN_TSR_TSTAT_L) >> CAN_TSR_TSTAT_L_Pos);
  
  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Stop the CAN module.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_Stop(CAN_HandleTypeDef *hcan)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    /* forces to reset state */
    SET_BIT(hcan->Instance->MCR, CAN_MCR_RESET);

    /* Reset the CAN ErrorCode */
    hcan->ErrorCode = HAL_CAN_ERROR_NONE;

    /* Change CAN peripheral state */
    hcan->State = HAL_CAN_STATE_READY;

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  This function handles CAN interrupt request.
  * @param  hcan  Pointer to a CAN_HandleTypeDef structure that contains
  *                the configuration information for the specified CAN module.
  * @retval None
  */
void HAL_CAN_IRQHandler(CAN_HandleTypeDef *hcan)
{
  /* Receive Interrupt */
  if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_RX_COMPLETE) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_RX_COMPLETE) != 0U))
  {
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_RX_COMPLETE);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    hcan->RxCpltCallback(hcan);
#else
    /* Recieve Complete Callback */
    HAL_CAN_RxCpltCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

  /* RB Almost Full Interrupt */
  if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_RX_FIFO_ALMOST_FULL) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_RX_FIFO_ALMOST_FULL) != 0U))
  {
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_RX_FIFO_ALMOST_FULL);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    hcan->RxFifoAlmostFullCallback(hcan);
#else
    /* Recieve fifo almost full Callback */
    HAL_CAN_RxFifoAlmostFullCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

  /* RB Full Interrupt */
  if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_RX_FIFO_FULL) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_RX_FIFO_FULL) != 0U))
  {
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_RX_FIFO_FULL);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    hcan->RxFifoFullCallback(hcan);
#else
    /* Recieve fifo full Callback */
    HAL_CAN_RxFifoFullCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

  /* Transmission Primary Interrupt */
  if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_TX_PTB_COMPLETE) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_TX_PTB_COMPLETE) != 0U))
  {
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_TX_PTB_COMPLETE);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    hcan->PtbTxCpltCallback(hcan);
#else
    /* PTB Transmit complete Callback */
    HAL_CAN_PtbTxCpltCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

  /* Transmission Secondary Interrupt */
  if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_TX_STB_COMPLETE) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_TX_STB_COMPLETE) != 0U))
  {
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_TX_STB_COMPLETE);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    hcan->StbTxCpltCallback(hcan);
#else
    /* STB Transmit complete Callback */
    HAL_CAN_StbTxCpltCallback(hcan, hcan->LastSTBTxType);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

  /* Abort Interrupt */
  if (__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_TX_ABORT_COMPLETE) != 0U)
  {
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_TX_ABORT_COMPLETE);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    hcan->TxAbortCallback(hcan);
#else
    /* Abort Interrupt Callback */
    HAL_CAN_TxAbortCallback(hcan, hcan->LastAbortTxType);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

  /* Time Trigger Interrupt */
  if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_TRIGGER_COMPLETE) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_TRIGGER_COMPLETE) != 0U))
  {
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_TRIGGER_COMPLETE);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    if (hcan->LastTimeTrigType == CAN_TT_RX_TIME_TRIG)
    {
      hcan->TT_RxTimeTrigCallback(hcan);
    }
    else if (hcan->LastTimeTrigType == CAN_TT_TX_SINGLE_TRIG)
    {
      hcan->TT_TxSingleTrigCallback(hcan);
    }
    else if (hcan->LastTimeTrigType == CAN_TT_TX_START_TRIG)
    {
      hcan->TT_TxStartTrigCallback(hcan);
    }
    else if (hcan->LastTimeTrigType == CAN_TT_TX_STOP_TRIG)
    {
      hcan->TT_TxStopTrigCallback(hcan);
    }
#else
    /* TTCAN Callback */
    if (hcan->LastTimeTrigType == CAN_TT_RX_TIME_TRIG)
    {
      HAL_CAN_TT_RxTimeTrigCallback(hcan);
    }
    else if (hcan->LastTimeTrigType == CAN_TT_TX_SINGLE_TRIG)
    {
      HAL_CAN_TT_TxSingleTrigCallback(hcan);
    }
    else if (hcan->LastTimeTrigType == CAN_TT_TX_START_TRIG)
    {
      HAL_CAN_TT_TxStartTrigCallback(hcan);
    }
    else if (hcan->LastTimeTrigType == CAN_TT_TX_STOP_TRIG)
    {
      HAL_CAN_TT_TxStopTrigCallback(hcan);
    }
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

